output.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: load_test.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 40s max duration (incl. graceful stop):
           * default: Up to 100 looping VUs for 10s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 010/100 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 010/100 VUs  01.0s/10.0s

running (02.0s), 020/100 VUs, 9 complete and 0 interrupted iterations
default   [  20% ] 020/100 VUs  02.0s/10.0s

running (03.0s), 030/100 VUs, 25 complete and 0 interrupted iterations
default   [  30% ] 030/100 VUs  03.0s/10.0s

running (04.0s), 040/100 VUs, 48 complete and 0 interrupted iterations
default   [  40% ] 040/100 VUs  04.0s/10.0s

running (05.0s), 050/100 VUs, 84 complete and 0 interrupted iterations
default   [  50% ] 050/100 VUs  05.0s/10.0s

running (06.0s), 060/100 VUs, 124 complete and 0 interrupted iterations
default   [  60% ] 060/100 VUs  06.0s/10.0s

running (07.0s), 070/100 VUs, 183 complete and 0 interrupted iterations
default   [  70% ] 070/100 VUs  07.0s/10.0s

running (08.0s), 079/100 VUs, 246 complete and 0 interrupted iterations
default   [  80% ] 079/100 VUs  08.0s/10.0s

running (09.0s), 089/100 VUs, 319 complete and 0 interrupted iterations
default   [  90% ] 089/100 VUs  09.0s/10.0s

running (10.0s), 099/100 VUs, 400 complete and 0 interrupted iterations
default   [ 100% ] 099/100 VUs  10.0s/10.0s

running (11.0s), 012/100 VUs, 488 complete and 0 interrupted iterations
default ↓ [ 100% ] 099/100 VUs  10s

     data_received..................: 765 kB 69 kB/s
     data_sent......................: 639 kB 57 kB/s
     http_req_blocked...............: avg=145.49µs min=0s      med=0s      max=1.79ms   p(90)=608.78µs p(95)=1.06ms   p(99)=1.31ms  
     http_req_connecting............: avg=123.56µs min=0s      med=0s      max=1.79ms   p(90)=531.15µs p(95)=695.74µs p(99)=1.2ms   
   ✗ http_req_duration..............: avg=109.17ms min=65.56ms med=96.54ms max=320.43ms p(90)=154.96ms p(95)=199.02ms p(99)=269.85ms
       { expected_response:true }...: avg=109.17ms min=65.56ms med=96.54ms max=320.43ms p(90)=154.96ms p(95)=199.02ms p(99)=269.85ms
   ✓ http_req_failed................: 0.00%  ✓ 0         ✗ 500  
     http_req_receiving.............: avg=712.99µs min=0s      med=0s      max=15.1ms   p(90)=882.51µs p(95)=6.5ms    p(99)=12.61ms 
     http_req_sending...............: avg=47.6µs   min=0s      med=0s      max=5.13ms   p(90)=0s       p(95)=219.38µs p(99)=723.09µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=108.41ms min=65.56ms med=96.16ms max=320.43ms p(90)=154.9ms  p(95)=198.97ms p(99)=269.33ms
     http_reqs......................: 500    44.882431/s
     iteration_duration.............: avg=1.11s    min=1.07s   med=1.1s    max=1.32s    p(90)=1.16s    p(95)=1.21s    p(99)=1.28s   
     iterations.....................: 500    44.882431/s
     vus............................: 12     min=10      max=99 
     vus_max........................: 100    min=100     max=100


running (11.1s), 000/100 VUs, 500 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  10s